# Electrical Per Phase Data Current Phase A Property

Source: https://www.revitapidocs.com/2026/5442d2ed-2005-f8a7-1515-27172a594f82.htm

---

| Electrical Per Phase Data Current Phase A Property |
| --- |

The effective value of current on electrical phase A.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CurrentPhaseA { get; }
```

```
Public ReadOnly Property CurrentPhaseA As Double
	Get
```

```
public:
property double CurrentPhaseA {
	double get ();
}
```

```
member CurrentPhaseA : float with get
```

#### Property Value

Double See Also

#### Reference

ElectricalPerPhaseData Class Autodesk.Revit.DB.Electrical Namespace